import java.util.Random;

public class PeopleGenerator {
    Random random = new Random();
    private final int minAge = 3;
    private final int maxAge = 90;
    public Person generatePerson(){
        if(isAMan()){
            return new Person(generateMaleName(),generateMaleSurname(),generateAge(), Person.gender.male);
        }else{
            return new Person(generateFemaleName(),generateFemaleSurname(),generateAge(), Person.gender.female);
        }
    }
    private int generateAge(){
        return random.nextInt(maxAge) + minAge;
    }
    private boolean isAMan(){
        return random.nextBoolean();
    }
    private String generateMaleName(){
        String[] maleName = new String[]{"Август","Августин","Авраам","Агафон","Адонис","Акайо","Алан","Александр",
                "Алексей","Альберт","Альфред","Анастасий","Анатолий","Андрей","Анисий","Антон","Аполлинарий",
                "Аполлон","Аристарх","Аркадий","Арсен","Арсений","Артем","Артемий","Артур","Бенедикт","Богдан",
                "Болеслав","Борис","Борислав","Бронислав","Вадим","Валентин","Валерий","Василий","Вениамин",
                "Викентий","Виктор","Вилен","Виссарион","Виталий","Влад","Владимир","Владислав","Владлен",
                "Вольдемар","Всеволод","Гавриил","Гарри","Геннадий","Георгий","Герман","Глеб","Гордей","Давид",
                "Даниил","Демьян","Денис","Джеймс","Джек","Джозеф","Дмитрий","Евгений","Евдоким","Егор","Елисей",
                "Ефим","Захар","Зиновий","Иван","Игнатий","Игорь","Илларион","Илья","Иннокентий","Иосиф","Ираклий",
                "Казимир","Камиль","Касьян","Ким","Кир","Кирилл","Клим","Климент","Кондрат","Константин","Лев",
                "Леон","Леонид","Леонтий","Магдалина","Макар","Максим","Марат","Марк","Мартин","Матвей","Мирон",
                "Митрофан","Михаил","Модест","Моисей","Назар","Наум","Никанор","Никита","Никифор","Николай","Олег",
                "Оливер","Павел","Парамон","Патрик","Петр","Платон","Райан","Раймонд","Ренат","Рику","Ринат","Роберт",
                "Родион","Роман","Ростислав","Руслан","Рустам","Савва","Савелий","Самсон","Самуил","Святослав",
                "Севастьян","Семен","Сергей","Сора","Станислав","Такеши","Тарас","Теодор","Терентий","Тимофей",
                "Тимур","Тихон","Томас","Фаддей","Федор","Федот","Феликс","Филат","Филимон","Филипп","Эдгар","Эдуард",
                "Эльдар","Юлиан","Юлий","Юма","Яков","Ямато","Ян",};
        return maleName[random.nextInt(maleName.length)];
    }
    private String generateFemaleName(){
        String[] femaleNames = new String[]{"Аврора","Агата","Агнесса","Агния","Ада","Аделаида","Аделина","Акулина",
                "Алевтина","Александра","Алена","Алина","Алиса","Алла","Алсу","Альбина","Альфия","Амалия","Амелия",
                "Анастасия","Ангелина","Анжела","Анжелика","Анна","Антонина","Анфиса","Ариадна","Арина","Беатрис",
                "Белла","Берта","Божена","Валентина","Валерия","Ванда","Варвара","Василиса","Венера","Вера","Вероника",
                "Виктория","Виолетта","Вита","Габриэлла","Галина","Гелла","Генриетта","Гертруда","Глафира","Глория",
                "Грейс","Грета","Дана","Даниэла","Дарина","Дарья","Даяна","Джессика","Диана","Дина","Динара",
                "Доминика","Ева","Евгения","Евдокия","Екатерина","Елена","Елизавета","Есения","Жаклин","Зинаида",
                "Злата","Зоряна","Иветта","Изабелла","Изольда","Илга","Илона","Инга","Инесса","Инна","Ираида",
                "Ирина","Калерия","Камилла","Капитолина","Карина","Каролина","Кира","Клавдия","Клара","Клариса",
                "Кристина","Лада","Лариса","Леся","Лидия","Лика","Лилиана","Лилия","Лина","Лолита","Луиза","Любовь",
                "Майя","Маргарита","Марианна","Марина","Мария","Марта","Марфа","Мелания","Мелисса","Милана","Милена",
                "Мирослава","Мирра","Надежда","Наоми","Наталия","Наталья","Нелли","Ника","Николь","Нина","Нинель",
                "Нонна","Оксана","Олеся","Оливия","Паула","Полина","Рада","Радмила","Раиса","Раяна","Регина","Рената",
                "Римма","Рита","Роза","Роксана","Сабина","Саки","Сакура","Сарра","Светлана","Серафима","Сильвия",
                "Снежана","София","Софья","Стелла","Таисия","Тамара","Тамила","Татьяна","Тереза","Ульяна","Фаина",
                "Хина","Шарлотта","Шейла","Эдита","Элеонора","Элина","Элла","Эльвира","Эльза","Эмили","Эмилия",
                "Эмма","Юи","Юлиана","Юлия","Яна",};
        return femaleNames[random.nextInt(femaleNames.length)];
    }
    private String generateMaleSurname() {
        String[] maleSurnames = new String[]{"Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов",
                "Михайлов", "Новиков", "Морозов", "Волков", "Алексеев", "Лебедев", "Сем", "Егоров", "Павлов", "Козлов",
                "Степанов", "Николаев", "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьев",
                "Борисов", "Яковлев", "Григорьев", "Романов", "Воробьев", "Сергеев", "Кузьмин", "Фролов", "Александров",
                "Дмитриев", "Королев", "Гусев", "Киселев", "Ильин", "Максимов", "Поляков", "Сорокин", "Виноградов",
                "Ковалев", "Белов", "Медведев", "Антонов", "Тарасов", "Жуков", "Баранов", "Филиппов", "Комаров",
                "Давыдов", "Беляев", "Герасимов", "Богданов", "Осипов", "Сидоров", "Матвеева", "Титов", "Марков",
                "Миронов", "Крылов", "Куликов", "Карпов", "Власов", "Мельников", "Денисов", "Гаврилов", "Тихонов",
                "Казаков", "Афанасьев", "Данилов", "Савельев", "Тимофеев", "Фомин", "Чернов", "Абрамов", "Мартынов",
                "Ефимов", "Федотов", "Щербаков", "Назаров", "Калинин", "Исаев", "Чернышев", "Быков", "Маслов",
                "Родионов", "Коновалов", "Лазарев", "Воронин", "Климов", "Филатов", "Пономарев", "Голубев",
                "Кудрявцев", "Прохоров", "Наумов", "Потапов", "Журавлев", "Овчинников", "Трофимов", "Леонов",
                "Соболев", "Ермаков", "Колесников", "Гончаров", "Емельянов", "Никифоров", "Грачев", "Котов", "Гришин",
                "Ефремов", "Архипов", "Громов", "Кириллов", "Малышев", "Панов", "Моисеев", "Румянцев", "Акимов",
                "Кондратьев", "Бирюков", "Горбунов", "Анисимов", "Еремин", "Тихомиров", "Галкин", "Лукьянов",
                "Михеев", "Скворцов", "Юдин", "Белоусов", "Нестеров", "Симонов", "Прокофьев", "Харитонов", "Князев",
                "Цветков", "Левин", "Митрофанов", "Воронов", "Аксенов", "Софронов", "Мальцев", "Логинов", "Горшков",
                "Савин", "Краснов", "Майоров", "Демидов", "Елисеев", "Рыбаков", "Сафонов", "Плотников", "Демин",
                "Хохлов", "Фадеев", "Молчанов", "Игнатов", "Литвинов", "Ершов", "Ушаков", "Дементьев", "Рябов", "Мухин",
                "Калашников", "Леонтьев", "Лобанов", "Кузин", "Корнеев", "Евдокимов", "Бородин", "Платонов", "Некрасов",
                "Балашов", "Бобров", "Жданов", "Блинов", "Игнатьев", "Коротков", "Муравьев", "Крюков", "Беляков",
                "Богомолов", "Дроздов", "Лавров", "Зуев", "Петухов", "Ларин", "Никулин", "Серов", "Терентьев", "Зотов",
                "Устинов", "Фокин", "Самойлов", "Константинов", "Сахаров", "Шишкин", "Самсонов", "Черкасов", "Чистяков",
                "Носов", "Спиридонов", "Карасев", "Авдеев", "Воронцов", "Зверев", "Владимиров", "Селезнев", "Нечаев",
                "Кудряшов", "Седов", "Фирсов", "Андрианов", "Панин", "Головин", "Терехов", "Ульянов", "Шестаков",
                "Агеев", "Никонов", "Селиванов", "Баженов", "Гордеев", "Кожевников", "Пахомов", "Зимин", "Костин",
                "Широков", "Филимонов", "Ларионов", "Овсянников", "Сазонов", "Суворов", "Нефедов", "Корнилов",
                "Любимов", "Львов", "Горбачев", "Копылов", "Лукин", "Токарев", "Кулешов", "Шилов", "Большаков",
                "Панкратов", "Родин", "Шаповалов", "Покровский", "Бочаров", "Никольский", "Маркин", "Горелов",
                "Агафонов", "Березин", "Ермолаев", "Зубков", "Куприянов", "Трифонов", "Масленников", "Круглов",
                "Третьяков", "Колосов", "Рожков", "Артамонов", "Шмелев", "Лаптев", "Лапшин", "Федосеев", "Зиновьев",
                "Зорин", "Уткин", "Столяров", "Зубов", "Ткачев", "Дорофеев", "Антипов", "Завьялов", "Свиридов",
                "Золотарев", "Кулаков", "Мещеряков", "Макеев", "Дьяконов", "Гуляев", "Петровский", "Бондарев",
                "Поздняков", "Панфилов", "Кочетков", "Суханов", "Рыжов", "Старостин", "Калмыков", "Колесов", "Золотов",
                "Кравцов", "Субботин", "Шубин", "Щукин", "Лосев", "Винокуров", "Лапин", "Парфенов", "Исаков",
                "Голованов", "Коровин", "Розанов", "Артемов", "Козырев", "Русаков", "Алешин", "Крючков", "Булгаков",
                "Кошелев", "Сычев", "Синицын", "Черных", "Рогов", "Кононов", "Лаврентьев", "Евсеев", "Пименов",
                "Пантелеев", "Горячев", "Аникин", "Лопатин", "Рудаков", "Одинцов", "Серебряков", "Панков", "Дегтярев",
                "Орехов", "Царев", "Шувалов", "Кондрашов", "Горюнов", "Дубровин", "Голиков", "Курочкин", "Латышев",
                "Севастьянов", "Вавилов", "Ерофеев", "Сальников", "Клюев", "Носков", "Озеров", "Кольцов", "Комиссаров",
                "Меркулов", "Киреев", "Хомяков", "Булатов", "Ананьев", "Буров", "Шапошников", "Дружинин", "Островский",
                "Шевелев", "Долгов", "Суслов", "Шевцов", "Пастухов", "Рубцов", "Бычков", "Глебов", "Ильинский",
                "Успенский", "Дьяков", "Кочетов", "Вишневский", "Высоцкий", "Глухов", "Дубов", "Бессонов", "Ситников",
                "Астафьев", "Мешков", "Шаров", "Яшин", "Козловский", "Туманов", "Басов", "Корчагин", "Болдырев",
                "Олейников", "Чумаков", "Фомичев", "Губанов", "Дубинин", "Шульгин", "Касаткин", "Пирогов", "Семин",
                "Трошин", "Горохов", "Стариков", "Щеглов", "Фетисов", "Колпаков", "Чесноков", "Зыков", "Верещагин",
                "Минаев", "Руднев", "Троицкий", "Окулов", "Ширяев", "Малинин", "Черепанов", "Измайлов", "Алехин",
                "Зеленин", "Касьянов", "Пугачев", "Павловский", "Чижов", "Кондратов", "Воронков", "Капустин",
                "Сотников", "Демьянов", "Косарев", "Беликов", "Сухарев", "Белкин", "Беспалов", "Кулагин", "Савицкий",
                "Жаров", "Хромов", "Еремеев", "Карташов", "Астахов", "Русанов", "Сухов", "Вешняков", "Волошин", "Козин",
                "Худяков", "Жилин", "Малахов", "Сизов", "Ежов", "Толкачев", "Анохин", "Вдовин", "Бабушкин", "Усов",
                "Лыков", "Горлов", "Коршунов", "Маркелов", "Постников", "Черный", "Дорохов", "Свешников", "Гущин",
                "Калугин", "Блохин", "Сурков", "Кочергин", "Греков", "Казанцев", "Швецов", "Ермилов", "Парамонов",
                "Агапов", "Минин", "Корнев", "Черняев", "Гуров", "Ермолов", "Сомов", "Добрынин", "Барсуков", "Глушков",
                "Чеботарев", "Москвин", "Уваров", "Безруков", "Муратов", "Раков", "Снегирев", "Гладков", "Злобин",
                "Моргунов", "Поликарпов", "Рябинин", "Судаков", "Кукушкин", "Калачев", "Грибов", "Елизаров",
                "Звягинцев", "Корольков", "Федосов", "Источник",};
        return maleSurnames[random.nextInt(maleSurnames.length)];
    }
    private String generateFemaleSurname() {
        String surname= generateMaleSurname();
        char[] sN = surname.toCharArray();
        String ending = "" + sN[sN.length-2] + sN[sN.length-1];
        String partOfTheSurname = surname.toString().substring(0,sN.length - 3);
        switch(ending){
            case("ий"):
            case("ый"):
            case("ой"): surname = partOfTheSurname + "ая"; break;
            default:
                surname = surname.toString() + "a";

        }
        return surname;
    }
}
